{
  "pk": "user#4sVTVPd6aJdRq",
  "sk": "profile",
  "attributes": {
    "athleteProfile": {
      "confidence": 0.95,
      "lastUpdated": "2025-09-01T11:43:21.058Z",
      "sources": ["workouts", "conversations", "memories", "coach_config"],
      "summary": "Mark is an experienced intermediate CrossFit athlete with 3+ years of consistent training who demonstrates exceptional discipline and systematic progression toward specific strength targets: 315# bench/squat/deadlift and 185# push press (currently at 275/265/295/175). He trains 6 days per week in structured 60-minute sessions, primarily following CompTrain methodology with 4-8 week strength-focused blocks. Recent training has shown significant progress with 275# deadlifts for triples, 215# front squats at max effort, and solid bench press volume at 185-205#. Mark has notable mobility limitations including hip restrictions preventing deep squatting and shoulder mobility issues that contraindicate overhead squats, requiring modified overhead positions and alternative pressing patterns like hammer jammers and landmine work. He responds optimally to technically precise but concise coaching cues, periodic technique reminders, and systematic competence-building rather than excessive motivation. His learning style favors hands-on execution with video analysis for self-evaluation, requiring minimal micromanagement due to high self-initiative. Mark meticulously tracks progress through PRs, benchmark times, Whoop strain scores, and Athlytic metrics, celebrating systematic gains toward his strength targets. His training has evolved to include varied squat patterns (Zerchers, front squats) that work around mobility limitations while building strength, plus active recovery sessions like rucking with family that fit his busy work and family schedule. He struggles with evening mobility work consistency but has shown improved movement quality when mobility is integrated into training sessions. Mark excels at pulling movements and pressing strength but continues developing gymnastics capacity (T2B progression) and overhead positioning, with recent sessions showing breakthrough progress in hollow/arch power development.",
      "version": 2
    },
    "avatar": {
      "s3Key": "",
      "url": ""
    },
    "demographics": {},
    "displayName": "Mark Fowler",
    "email": "m3kan1ca+001@gmail.com",
    "firstName": "Mark",
    "fitness": {},
    "lastName": "Fowler",
    "metadata": {
      "isActive": true
    },
    "nickname": "Mark",
    "preferences": {},
    "subscription": {},
    "userId": "4sVTVPd6aJdRq",
    "username": "m3kan1cal"
  },
  "createdAt": "2025-09-01T11:43:21.058Z",
  "entityType": "user",
  "gsi1pk": "email#m3kan1ca+001@gmail.com",
  "gsi1sk": "profile",
  "gsi2pk": "username#m3kan1cal",
  "gsi2sk": "profile",
  "updatedAt": "2025-09-01T11:43:21.058Z"
}
