{
  "programId": "program_63gocaz-j-AYRsb0094ik_1761431762085_v9luaxn4e",
  "programContext": {
    "goals": [
      "Establish new 1RM baselines on deadlift, back squat, bench press, and push press",
      "Progress conservatively from current rep PRs (285x3 DL, 255x3 squat, 255x3 bench, 165x3 push press)",
      "Maintain conditioning capacity through finishers and one longer conditioning day",
      "Integrate mobility and stretching work for shoulder and upper back restrictions",
      "Manage recovery effectively with 6-hour sleep constraint and high work stress"
    ],
    "purpose": "Conservative progression block focused on the four main powerlifting movements (deadlift, squat, bench press, push press) culminating in max testing to establish new baselines. Designed for masters athlete with limited recovery capacity.",
    "successMetrics": [],
    "equipmentConstraints": [
      "barbell",
      "squat rack",
      "bench press",
      "deadlift platform",
      "dumbbells",
      "kettlebells",
      "pull-up bar",
      "rowing machine",
      "assault bike",
      "ski erg",
      "box",
      "medicine ball",
      "resistance bands",
      "foam roller"
    ]
  },
  "dailyWorkoutTemplates": [
    {
      "templateId": "template_day1_primary",
      "dayNumber": 1,
      "templateType": "primary",
      "templatePriority": 1,
      "scheduledDate": "",
      "phaseId": "phase_1",
      "name": "Lower Body Strength - Squat Focus",
      "description": "Foundation week starts with moderate volume back squats to establish movement patterns and build base strength.",
      "estimatedDuration": 60,
      "requiredEquipment": [
        "barbell",
        "squat rack",
        "dumbbells",
        "assault bike",
        "foam roller"
      ],
      "workoutContent": "Warmup (15 minutes):\nFoam roll quads, IT band, glutes (5 min). Hip circles 10 each direction, leg swings front/back and side/side 10 each leg. Deep bodyweight squat holds 3x30 seconds - work on getting comfortable in the bottom position. PVC pass-throughs 15 reps, then empty barbell squats 2x10 focusing on depth and chest position.\n\nMobility Drill:\nThoracic extensions over foam roller 2x10 reps. This addresses your upper back restriction - feel the mid-back opening up.\n\nStrength Block:\nBack Squat 5x5 @ 205lbs (75% of estimated 1RM)\nThis is your foundation week - we're establishing consistent depth and movement quality. Feel your weight shift to mid-foot at the bottom. Keep your chest up throughout the entire rep. Don't rush the descent - control it down, explode up. Rest 3 minutes between sets.\n\nFilm your third set if possible - I want to see depth consistency and torso position.\n\nScale: If depth breaks or form deteriorates, drop to 195lbs immediately. Quality over weight always.\n\nBulgarian Split Squat 3x10 each leg @ 40lb dumbbells\nThis leverages your lunge strength. Front leg does 90% of the work. Keep torso upright, don't lean forward. Feel the stretch in your rear leg hip flexor. Rest 90 seconds between legs.\n\nLying Hamstring Curls 3x12 @ moderate weight\nControl the negative. Squeeze at the top for 1 second. Building posterior chain to support your deadlift goal.\n\nConditioning Finisher (12 minutes):\nEMOM 12:\nMinute 1: 12 cal assault bike\nMinute 2: 15 kettlebell swings (53lb)\nMinute 3: 20 air squats\nRepeat 4 rounds total.\n\nPace: Moderate intensity - you should finish each movement with 15-20 seconds rest. This is aerobic work, not a sprint. Breathe through your nose as much as possible. If you're gasping, you're going too hard.\n\nCooldown:\nLight stretching - hip flexors, quads, hamstrings. 5 minutes total.",
      "coachingNotes": "This is week 1 - we're building the foundation for your 275lb squat goal. Focus on hitting depth every single rep. The weight should feel manageable, maybe RPE 6-7. If it feels too easy, that's fine - we're establishing patterns, not testing limits yet. The Bulgarian split squats will feel harder than the back squats - that's normal and exactly what we want. Your conditioning finisher should leave you breathing but not destroyed. We need you recovered for Day 2.",
      "prescribedExercises": [
        {
          "exerciseName": "Back Squat",
          "movementType": "barbell"
        },
        {
          "exerciseName": "Bulgarian Split Squat",
          "movementType": "dumbbell"
        },
        {
          "exerciseName": "Assault Bike",
          "movementType": "cardio"
        },
        {
          "exerciseName": "Kettlebell Swing",
          "movementType": "kettlebell"
        }
      ],
      "status": "pending",
      "completedAt": null,
      "linkedWorkoutId": null,
      "userFeedback": null,
      "adaptationHistory": []
    },
    {
      "templateId": "template_day2_primary",
      "dayNumber": 2,
      "templateType": "primary",
      "templatePriority": 1,
      "scheduledDate": "",
      "phaseId": "phase_1",
      "name": "Upper Body Strength - Bench Press Focus",
      "description": "Leverage your bench press strength with moderate volume while building pressing foundation for the 315lb goal.",
      "estimatedDuration": 60,
      "requiredEquipment": [
        "barbell",
        "bench press",
        "dumbbells",
        "pull-up bar",
        "rowing machine",
        "foam roller"
      ],
      "workoutContent": "Warmup (15 minutes):\nFoam roll upper back, lats, chest (5 min). Arm circles 10 forward/10 backward. Band pull-aparts 3x15 - feel your shoulder blades squeeze together. PVC pass-throughs 15 reps focusing on the range you CAN achieve - don't force it. Empty bar bench press 2x10, then 135lbs x8, 185lbs x5 ramping up.\n\nShoulder Mobility Drill:\nWall slides 2x10 reps. Go only as high as you can maintain good position - respect your shoulder limitation. We're working on gradual improvement, not forcing range.\n\nStrength Block:\nBench Press 5x5 @ 215lbs (80% of your current working weight)\nThis is your strength - let's build on it systematically. Set up tight: feet driven into floor, shoulder blades squeezed, slight arch. Bar path should be straight down to lower chest, straight up. Feel your legs driving the entire time. Rest 3 minutes between sets.\n\nFocus today: Bar path consistency. Every rep should look identical.\n\nClose-Grip Bench Press 3x8 @ 165lbs\nGrip just inside shoulder width. This builds your lockout strength for the 315 goal. Keep elbows tucked at 45 degrees. Control the descent, explosive press. Rest 2 minutes between sets.\n\nWeighted Pull-ups 4x6 @ 25lb weight vest or plate\nYou're strong at pulling - we're maintaining that. Dead hang start, chest to bar finish. Control the negative. Rest 2 minutes between sets.\n\nScale: If you can't get 6 reps, drop weight or go bodyweight.\n\nDumbbell Rows 3x10 each arm @ 70lb\nStrict form. Pull elbow past your ribs. Squeeze at the top. Feel your lat contract.\n\nConditioning Finisher (10 minutes):\n3 Rounds for time:\n250m row\n15 push-ups\n20 sit-ups\n\nTarget: Complete in 8-10 minutes. Row should be moderate pace (not a sprint). Push-ups should be unbroken sets - scale to knees if needed to maintain quality. This is conditioning work to maintain your aerobic base while we build strength.",
      "coachingNotes": "Your bench press is a strength - we're building systematically toward 315. The 215lbs for 5x5 should feel very manageable, maybe RPE 6. Save your energy for the close-grip work, which will be harder. Pull-ups maintain your pulling strength while we focus on pressing. The conditioning finisher is moderate - you should be able to talk in short sentences throughout. Don't crush yourself on Day 2. We have 4 more training days this week.",
      "prescribedExercises": [
        {
          "exerciseName": "Bench Press",
          "movementType": "barbell"
        },
        {
          "exerciseName": "Close-Grip Bench Press",
          "movementType": "barbell"
        },
        {
          "exerciseName": "Weighted Pull-ups",
          "movementType": "bodyweight"
        },
        {
          "exerciseName": "Rowing Machine",
          "movementType": "cardio"
        }
      ],
      "status": "pending",
      "completedAt": null,
      "linkedWorkoutId": null,
      "userFeedback": null,
      "adaptationHistory": []
    },
    {
      "templateId": "template_day3_primary",
      "dayNumber": 3,
      "templateType": "primary",
      "templatePriority": 1,
      "scheduledDate": "",
      "phaseId": "phase_1",
      "name": "Posterior Chain - Deadlift Focus",
      "description": "Build deadlift foundation with moderate volume and technical focus, addressing your identified weakness.",
      "estimatedDuration": 60,
      "requiredEquipment": [
        "barbell",
        "deadlift platform",
        "dumbbells",
        "pull-up bar",
        "ski erg",
        "foam roller"
      ],
      "workoutContent": "Warmup (15 minutes):\nFoam roll hamstrings, glutes, lower back (5 min). Cat-cow stretches 2x10. Hip hinges with PVC on back 2x10 - feel the hinge pattern. Glute bridges 2x15. Light Romanian deadlifts with empty bar 2x10, then 135lbs x8, 185lbs x5, 225lbs x3 ramping up to working weight.\n\nStrength Block:\nDeadlift 5x5 @ 235lbs (75% of your estimated max, conservative start)\nThis is THE priority lift for your 315 goal. We're starting conservative to nail technique. Setup: feet hip width, bar over mid-foot, shins to bar, chest up, lats engaged (feel like you're bending the bar), big breath and brace, then push the floor away.\n\nFeel your weight in mid-foot throughout the entire pull. Your chest and hips should rise together - if your hips shoot up first, that's inefficient and we need to fix it.\n\nFilm your heaviest set. I need to see your setup and pull pattern.\n\nRest 3-4 minutes between sets. These should feel like RPE 7 - challenging but not grinding.\n\nScale: If form breaks down (rounded back, hips rising early), drop to 225lbs immediately.\n\nRomanian Deadlift 3x8 @ 185lbs\nThis builds your posterior chain for the conventional deadlift. Bar stays close to legs entire time. Feel the stretch in your hamstrings. Don't go lower than mid-shin if hamstring flexibility is limited. Rest 2 minutes.\n\nBarbell Rows 4x8 @ 155lbs\nStrict form. Pull to lower chest/upper abs. Squeeze shoulder blades together at top. Rest 90 seconds.\n\nPull-ups 3x8 bodyweight\nDead hang to chest-to-bar. Control the negative. Rest 90 seconds.\n\nConditioning Finisher (12 minutes):\nEMOM 12:\nMinute 1: 15 cal ski erg\nMinute 2: 12 kettlebell swings (70lb)\nMinute 3: 15 box step-ups (20 inch box, bodyweight)\nRepeat 4 rounds.\n\nPace: Moderate. Finish each movement with 15-20 seconds rest. The ski erg hits your posterior chain - don't go all-out. Kettlebell swings are hip hinge practice. Step-ups maintain your single-leg strength.",
      "coachingNotes": "Deadlift is your focus today and a key weakness we're addressing. The 235lbs should feel very manageable - we're building technical proficiency before adding weight. I want perfect reps, not heavy grinds. Your setup is critical: take 10 seconds to get positioned correctly every single rep. The RDLs will feel harder than the conventional deadlifts - that's normal. Your hamstrings are getting worked. The conditioning finisher is posterior chain focused to complement the strength work. You should feel worked but not destroyed.",
      "prescribedExercises": [
        {
          "exerciseName": "Deadlift",
          "movementType": "barbell"
        },
        {
          "exerciseName": "Romanian Deadlift",
          "movementType": "barbell"
        },
        {
          "exerciseName": "Barbell Row",
          "movementType": "barbell"
        },
        {
          "exerciseName": "Ski Erg",
          "movementType": "cardio"
        }
      ],
      "status": "pending",
      "completedAt": null,
      "linkedWorkoutId": null,
      "userFeedback": null,
      "adaptationHistory": []
    },
    {
      "templateId": "template_day4_primary",
      "dayNumber": 4,
      "templateType": "primary",
      "templatePriority": 1,
      "scheduledDate": "",
      "phaseId": "phase_1",
      "name": "Upper Body Pressing - Push Press Focus",
      "description": "Develop explosive pressing power with push press while respecting shoulder limitations, plus accessory work.",
      "estimatedDuration": 55,
      "requiredEquipment": [
        "barbell",
        "squat rack",
        "dumbbells",
        "pull-up bar",
        "assault bike",
        "foam roller"
      ],
      "workoutContent": "Warmup (15 minutes):\nFoam roll upper back, lats (5 min). Shoulder circles 10 each direction. Band pull-aparts 3x15. Wall slides 2x10 - only go as high as you can with good form. Empty bar push press 2x10 focusing on dip and drive, then 95lbs x8, 115lbs x5 ramping up.\n\nMobility Drill:\nThoracic rotations (quadruped) 2x8 each side. This addresses your upper back restriction. Feel the rotation in your mid-back, not your lower back.\n\nStrength Block:\nPush Press 5x5 @ 135lbs (conservative start, building toward 185 goal)\nThis leverages leg drive to reduce shoulder ROM demands. Dip: 4-6 inches, vertical torso, knees track over toes. Drive: explosive hip and knee extension. Press: finish overhead in the range YOU can achieve safely - don't force full lockout if shoulder mobility doesn't allow it.\n\nFocus: Timing of the dip and drive. Feel your legs doing most of the work.\n\nRest 2-3 minutes between sets. These should feel like RPE 6-7.\n\nScale: If shoulder feels pinched or painful, reduce weight or switch to landmine press.\n\nIncline Dumbbell Press 3x10 @ 60lb dumbbells\nSet bench to 30-45 degrees. Press in the range you have. Control the negative. Rest 90 seconds.\n\nDumbbell Lateral Raises 3x12 @ 25lb dumbbells\nStrict form. Slight bend in elbow. Raise to shoulder height only - no higher. Feel your delts burning. Rest 60 seconds.\n\nDips 3x8-10 bodyweight\nLean forward slightly for chest emphasis. Full range YOU can achieve safely. Rest 90 seconds.\n\nScale: Use band assistance if needed.\n\nFace Pulls 3x15 @ light resistance band\nPull to face level. Squeeze shoulder blades together. This is shoulder health work. Rest 60 seconds.\n\nConditioning Finisher (10 minutes):\n5 Rounds:\n10 cal assault bike\n10 dumbbell thrusters (35lb dumbbells)\n10 burpees\n\nTarget: Complete in 8-10 minutes. Moderate pace throughout. Thrusters should be unbroken. Burpees should be steady, not frantic. This tests your conditioning while fatigued from pressing work.",
      "coachingNotes": "Push press is new stimulus toward your 185 goal. We're starting conservative at 135 to establish the movement pattern. The dip-drive timing is critical - practice it. Don't force overhead range you don't have. The accessory work builds shoulder strength and health. Face pulls are mandatory - they protect your shoulders. The conditioning finisher has pressing volume - manage your intensity so you can complete all rounds with consistent quality. If thrusters or burpees break down, scale the weight or reps.",
      "prescribedExercises": [
        {
          "exerciseName": "Push Press",
          "movementType": "barbell"
        },
        {
          "exerciseName": "Incline Dumbbell Press",
          "movementType": "dumbbell"
        },
        {
          "exerciseName": "Dips",
          "movementType": "bodyweight"
        },
        {
          "exerciseName": "Assault Bike",
          "movementType": "cardio"
        }
      ],
      "status": "pending",
      "completedAt": null,
      "linkedWorkoutId": null,
      "userFeedback": null,
      "adaptationHistory": []
    },
    {
      "templateId": "template_day5_primary",
      "dayNumber": 5,
      "templateType": "primary",
      "templatePriority": 1,
      "scheduledDate": "",
      "phaseId": "phase_1",
      "name": "Full Body Strength - Squat Variation",
      "description": "Front squat variation to build quad strength and address squat weakness from different angle.",
      "estimatedDuration": 60,
      "requiredEquipment": [
        "barbell",
        "squat rack",
        "dumbbells",
        "kettlebells",
        "rowing machine",
        "foam roller"
      ],
      "workoutContent": "Warmup (15 minutes):\nFoam roll quads, IT band, upper back (5 min). Hip circles, leg swings. Goblet squat holds 3x30 seconds. Wrist stretches - front rack position requires wrist mobility. Empty bar front squats 2x10, then 95lbs x8, 135lbs x5.\n\nMobility Drill:\nAnkle mobility (elevated heel squats) 2x10. Better ankle mobility improves squat depth.\n\nStrength Block:\nFront Squat 5x5 @ 165lbs (lighter than back squat, different stimulus)\nThis hits your quads harder and forces upright torso position. Elbows high throughout. Bar rests on front delts, not in your hands. Drive through mid-foot. Rest 3 minutes between sets.\n\nThis will feel awkward if you haven't done much front squat work. That's normal. Focus on staying upright.\n\nScale: If front rack position is uncomfortable due to shoulder mobility, use cross-arm grip or switch to goblet squats with heavy kettlebell.\n\nWalking Lunges 3x12 steps each leg @ 50lb dumbbells\nThis leverages your lunge strength. Long stride. Back knee nearly touches ground. Keep torso upright. Rest 90 seconds between sets.\n\nLeg Press 3x15 @ moderate weight\nFull range of motion. Control the negative. This adds volume without CNS fatigue. Rest 90 seconds.\n\nSeated Calf Raises 3x20 @ moderate weight\nFull stretch at bottom, full contraction at top. Rest 60 seconds.\n\nConditioning Finisher (12 minutes):\nFor time:\n1000m row\n50 kettlebell swings (53lb)\n30 box jumps (24 inch)\n\nTarget: Complete in 10-12 minutes. Row at sustainable pace (not a sprint). Break kettlebell swings into manageable sets (10-15 reps at a time). Box jumps should be controlled - step down, don't jump down. This is a longer effort that tests your aerobic capacity.",
      "coachingNotes": "Day 5 is full body work with front squat emphasis. This variation addresses your squat weakness from a different angle - the upright torso position is less forgiving than back squat. The 165lbs should feel manageable but challenging. Your walking lunges are a strength - push these hard. The conditioning finisher is longer effort - pace yourself on the row. You should finish breathing hard but not destroyed. Tomorrow is your longer conditioning day, so don't empty the tank today. Film your front squats if possible - I want to see torso position and elbow height.",
      "prescribedExercises": [
        {
          "exerciseName": "Front Squat",
          "movementType": "barbell"
        },
        {
          "exerciseName": "Walking Lunges",
          "movementType": "dumbbell"
        },
        {
          "exerciseName": "Rowing Machine",
          "movementType": "cardio"
        },
        {
          "exerciseName": "Kettlebell Swing",
          "movementType": "kettlebell"
        }
      ],
      "status": "pending",
      "completedAt": null,
      "linkedWorkoutId": null,
      "userFeedback": null,
      "adaptationHistory": []
    },
    {
      "templateId": "template_day6_primary",
      "dayNumber": 6,
      "templateType": "primary",
      "templatePriority": 1,
      "scheduledDate": "",
      "phaseId": "phase_1",
      "name": "Longer Conditioning Session",
      "description": "Build aerobic capacity and work capacity with 25-minute CrossFit-style workout.",
      "estimatedDuration": 45,
      "requiredEquipment": [
        "pull-up bar",
        "kettlebells",
        "box",
        "assault bike",
        "foam roller"
      ],
      "workoutContent": "Warmup (10 minutes):\nLight foam rolling (5 min). Jumping jacks, high knees, butt kicks. Arm circles. Hip circles. 2 rounds: 5 pull-ups, 10 push-ups, 15 air squats to get blood flowing.\n\nConditioning Workout:\n25-Minute AMRAP (As Many Rounds As Possible):\n5 pull-ups\n10 kettlebell swings (70lb)\n15 box step-ups (20 inch, alternating legs)\n20 cal assault bike\n\nThis is your longer conditioning day. Pace yourself - you have 25 minutes to work. Start at 70-75% effort and maintain that throughout. Don't sprint the first few rounds and crash. Consistent, sustainable pace is the goal.\n\nBreak movements before you have to: pull-ups in sets of 3-2 if needed, kettlebell swings in sets of 5, step-ups steady and controlled, bike at moderate pace.\n\nTarget: 6-8 rounds depending on your current conditioning level. This should feel like steady work, breathing hard but not gasping. You should be able to hold a short conversation (3-4 words at a time).\n\nScale: Pull-ups to band-assisted or ring rows. Reduce kettlebell weight to 53lb if needed. Reduce bike calories to 15 if needed.\n\nCooldown (10 minutes):\nWalk 5 minutes to bring heart rate down. Stretch: hip flexors, quads, hamstrings, lats, shoulders. This is active recovery work.",
      "coachingNotes": "This is your one longer conditioning day per week. The goal is aerobic capacity development, not destroying yourself. Pace is critical - if you go out too hard, you'll crash at 15 minutes. Start conservative. The 25-minute duration should feel long but manageable. Track your rounds completed - we'll retest this workout in a few weeks to measure conditioning progress. After this session, you're done for the week. Tomorrow is complete rest. Your body needs it after 6 training days. Don't skip the cooldown - it's part of your recovery protocol.",
      "prescribedExercises": [
        {
          "exerciseName": "Pull-ups",
          "movementType": "bodyweight"
        },
        {
          "exerciseName": "Kettlebell Swing",
          "movementType": "kettlebell"
        },
        {
          "exerciseName": "Box Step-ups",
          "movementType": "bodyweight"
        },
        {
          "exerciseName": "Assault Bike",
          "movementType": "cardio"
        }
      ],
      "status": "pending",
      "completedAt": null,
      "linkedWorkoutId": null,
      "userFeedback": null,
      "adaptationHistory": []
    },
    {
      "templateId": "template_day7_primary",
      "dayNumber": 7,
      "templateType": "optional",
      "templatePriority": 1,
      "scheduledDate": "",
      "phaseId": "phase_1",
      "name": "Complete Rest & Recovery",
      "description": "Mandatory rest day for tissue repair and adaptation after 6 training days.",
      "estimatedDuration": 20,
      "requiredEquipment": [
        "foam roller"
      ],
      "workoutContent": "Today is COMPLETE REST. No training. This is non-negotiable.\n\nYour body needs this day to adapt to the training stimulus from the past 6 days. Rest is when you actually get stronger - training just provides the stimulus.\n\nOptional Recovery Work (20 minutes):\n\nFoam Rolling Protocol:\n- Quads: 2 minutes each leg\n- IT band: 2 minutes each leg  \n- Hamstrings: 2 minutes each leg\n- Glutes: 2 minutes each side\n- Upper back: 2 minutes\n- Lats: 2 minutes each side\n\nStretching Protocol:\n- Hip flexor stretch: 90 seconds each side\n- Hamstring stretch: 90 seconds each leg\n- Quad stretch: 90 seconds each leg\n- Shoulder/chest doorway stretch: 90 seconds\n- Upper back/lat stretch: 90 seconds\n\nThis is OPTIONAL but highly recommended. You currently do minimal stretching and no foam rolling. Starting this protocol will improve your recovery, reduce soreness, and help with your shoulder and upper back mobility restrictions.\n\nOther Recovery Activities:\n- Walk 20-30 minutes at easy pace (optional)\n- Focus on sleep: aim for 7 hours minimum tonight\n- Hydration: drink water throughout the day\n- Nutrition: eat adequate protein and carbs to support recovery\n\nDo NOT:\n- Go to the gym\n- Do any conditioning work\n- Do any strength work\n- Do anything that elevates your heart rate significantly\n\nRest means rest. Discipline means following the program, including the rest days.",
      "coachingNotes": "This is your mandatory Sunday rest day. I know you're disciplined and might feel like you should be doing something, but rest IS doing something - it's allowing adaptation. Six training days is plenty for a 52-year-old masters athlete. Your body needs this recovery day. Use it. The optional foam rolling and stretching is highly encouraged given your current lack of recovery work. Even 20 minutes will make a difference. Focus on sleep tonight - you need 7-8 hours, not 5-6. Next week we'll build on this foundation week. Come back Monday ready to work.",
      "prescribedExercises": [],
      "status": "pending",
      "completedAt": null,
      "linkedWorkoutId": null,
      "userFeedback": null,
      "adaptationHistory": []
    },
    {
      "templateId": "template_day8_primary",
      "dayNumber": 8,
      "templateType": "primary",
      "templatePriority": 1,
      "scheduledDate": "",
      "phaseId": "phase_2",
      "name": "Lower Body Strength - Squat Volume Focus",
      "description": "High-volume squat work to build work capacity and technical proficiency, followed by unilateral leg work and conditioning finisher.",
      "estimatedDuration": 55,
      "requiredEquipment": [
        "barbell",
        "squat rack",
        "dumbbells",
        "assault bike"
      ],
      "workoutContent": "Warmup (12 minutes):\nHip circles 10 each direction, leg swings front/back and side/side 10 each, deep bodyweight squat holds 3x20 seconds, PVC pass-throughs 15 reps, goblet squats with light kettlebell 2x10. Get those hips and shoulders ready for volume work today.\n\nStrength Block:\nBack Squat 5x5 @ 210lbs (77% of estimated 1RM ~275lbs)\nThis is a 5lb jump from last week. Focus on hitting consistent depth every single rep - I want to see your hip crease below your knee. Feel your weight shift to mid-foot at the bottom position. Keep that chest up throughout the entire movement. Rest 3 minutes between sets. Film your third set if you can - I need to see depth consistency and check for any hip rise issues.\n\nScale: If form breaks on any rep, reduce weight to 200lbs immediately. Quality over ego.\n\nBulgarian Split Squat 4x10 each leg @ 40lb dumbbells\nWe're adding a set this week. 10 reps per leg, alternating legs. Focus on the front leg doing 90% of the work. Keep your torso upright - don't lean forward. Control the descent, drive through the front heel. Rest 90 seconds between sets. This will smoke your quads.\n\nLying Hamstring Curls 3x12 (bodyweight or light resistance band)\nSlow tempo: 3 seconds down, 1 second up. Feel the hamstring engagement. Rest 60 seconds between sets.\n\nConditioning Finisher:\nEMOM 12 minutes:\nMinute 1: 12 calories assault bike\nMinute 2: 15 kettlebell swings @ 53lbs\nMinute 3: 20 air squats\nMinute 4: Rest\n\nModerate pace on everything - you should finish each minute with 15-20 seconds rest. This is conditioning work to maintain capacity, not a sprint. Keep breathing controlled. If you're gasping, you're going too hard.\n\nCooldown:\n3 minutes easy bike spin, couch stretch 90 seconds each side, pigeon pose 60 seconds each side.",
      "coachingNotes": "Week 2 volume increase - we're adding 5lbs to the squat and an extra set on Bulgarian split squats. Watch for fatigue accumulation. The conditioning finisher is designed to be sustainable across all 12 minutes. Your squat is a weak point, so I'm prioritizing depth consistency and technical refinement over chasing numbers right now. If you feel beat up from last week, scale the squat weight to 205lbs - no shame in that.",
      "prescribedExercises": [
        {
          "exerciseName": "Back Squat",
          "movementType": "barbell"
        },
        {
          "exerciseName": "Bulgarian Split Squat",
          "movementType": "dumbbell"
        },
        {
          "exerciseName": "Assault Bike",
          "movementType": "cardio"
        },
        {
          "exerciseName": "Kettlebell Swing",
          "movementType": "kettlebell"
        }
      ],
      "status": "pending",
      "completedAt": null,
      "linkedWorkoutId": null,
      "userFeedback": null,
      "adaptationHistory": []
    },
    {
      "templateId": "template_day9_primary",
      "dayNumber": 9,
      "templateType": "primary",
      "templatePriority": 1,
      "scheduledDate": "",
      "phaseId": "phase_2",
      "name": "Upper Body Strength - Bench Press Volume",
      "description": "High-volume bench press work leveraging your pressing strength, followed by accessory pressing and pulling volume with conditioning finisher.",
      "estimatedDuration": 60,
      "requiredEquipment": [
        "barbell",
        "bench press",
        "dumbbells",
        "pull-up bar",
        "rowing machine"
      ],
      "workoutContent": "Warmup (10 minutes):\nArm circles forward/back 15 each, band pull-aparts 20 reps, scapular push-ups 15 reps, empty barbell bench press 2x10, light dumbbell rows 15 each arm. Prime those shoulders and upper back.\n\nStrength Block:\nBench Press 5x5 @ 215lbs (77% of estimated 1RM ~280lbs, conservative estimate from your 255x3)\nUp 5lbs from last week. This is your strength - let's leverage it. Focus on leg drive and maintaining your arch. Bar path should be straight up and down over your mid-chest. Lower controlled, press explosively. Rest 3 minutes between sets. Don't rush these.\n\nScale: If you miss a rep or form breaks, drop to 210lbs for remaining sets.\n\nClose-Grip Bench Press 4x8 @ 165lbs\nGrip just inside shoulder width. This targets your triceps hard. Control the descent, pause 1 second on chest, press up. Rest 2 minutes between sets. These should feel challenging but sustainable.\n\nDumbbell Incline Press 3x10 @ 60lb dumbbells\n30-degree incline. Full range of motion. Control the weight, don't bounce. Rest 90 seconds between sets.\n\nPull Volume:\nWeighted Pull-ups 4x6 @ 25lb plate\nStrict reps, full range of motion. If you can't get 6 reps, reduce weight to 15lbs or bodyweight. Rest 2 minutes between sets.\n\nBarbell Bent-Over Rows 3x10 @ 135lbs\nStrict form, pull to lower chest, squeeze shoulder blades. Rest 90 seconds between sets.\n\nConditioning Finisher:\n3 Rounds For Time (12-minute cap):\n400m row\n20 push-ups\n30 sit-ups\n\nModerate pace - aim to finish in 9-11 minutes. Push-ups should be unbroken or max 1 break per round. This is about maintaining pace, not sprinting.",
      "coachingNotes": "Bench is your strength - we're pushing volume here to build on that foundation. The close-grip work will help your lockout strength for heavier weights later. Pull volume is critical to balance all this pressing and keep your shoulders healthy. The conditioning finisher has a rowing component to hit posterior chain without taxing your legs before tomorrow's deadlift work. If your shoulders feel tweaky at all, back off immediately.",
      "prescribedExercises": [
        {
          "exerciseName": "Bench Press",
          "movementType": "barbell"
        },
        {
          "exerciseName": "Close-Grip Bench Press",
          "movementType": "barbell"
        },
        {
          "exerciseName": "Dumbbell Incline Press",
          "movementType": "dumbbell"
        },
        {
          "exerciseName": "Weighted Pull-ups",
          "movementType": "gymnastics"
        },
        {
          "exerciseName": "Rowing Machine",
          "movementType": "cardio"
        }
      ],
      "status": "pending",
      "completedAt": null,
      "linkedWorkoutId": null,
      "userFeedback": null,
      "adaptationHistory": []
    },
    {
      "templateId": "template_day10_primary",
      "dayNumber": 10,
      "templateType": "primary",
      "templatePriority": 1,
      "scheduledDate": "",
      "phaseId": "phase_2",
      "name": "Posterior Chain - Deadlift Volume Focus",
      "description": "High-volume deadlift work to address weakness, followed by posterior chain accessories and pulling volume with conditioning finisher.",
      "estimatedDuration": 65,
      "requiredEquipment": [
        "barbell",
        "deadlift platform",
        "dumbbells",
        "pull-up bar",
        "ski erg"
      ],
      "workoutContent": "Warmup (15 minutes):\nCat-cow stretches 10 reps, bird dogs 10 each side, glute bridges 15 reps, Romanian deadlifts with empty barbell 2x10, light deadlifts building to working weight 135x5, 185x5, 225x3. Take your time here - posterior chain needs to be fully warmed up.\n\nStrength Block:\nDeadlift 5x4 @ 245lbs (80% of your current working max ~305lbs estimated from 285x3)\nUp from 240lbs last week. We're building volume at a sustainable intensity. Focus on setup: feet hip-width, bar over mid-foot, shoulders slightly in front of bar, chest up, lats engaged. Feel the tension in your hamstrings before you pull. Drive through the floor, keep bar close to your body. Rest 3-4 minutes between sets. Film your heavy sets - I want to check for early hip rise.\n\nScale: If your hips shoot up early or your back rounds, drop to 235lbs immediately. Form is non-negotiable on deadlifts.\n\nRomanian Deadlifts 4x8 @ 185lbs\nThis is about hamstring and glute development. Hinge at the hips, keep bar close to legs, feel the stretch in your hamstrings. Don't go so low that your back rounds - stop when you feel the stretch. Rest 2 minutes between sets.\n\nSingle-Leg Romanian Deadlifts 3x10 each leg @ 35lb dumbbell\nBalance and hamstring work. Keep your hips square, don't rotate. Rest 90 seconds between sets.\n\nPull Volume:\nStrict Pull-ups 4x8 bodyweight\nDead hang to chin over bar. Control the descent. If you can't get 8, do as many strict as possible then finish with negatives. Rest 2 minutes between sets.\n\nDumbbell Rows 3x12 each arm @ 70lbs\nStrict form, pull elbow back, squeeze at top. Rest 60 seconds between arms.\n\nConditioning Finisher:\nAMRAP 10 minutes:\n10 calories ski erg\n15 kettlebell swings @ 53lbs\n20 mountain climbers (total)\n\nSteady pace - aim for 5-6 rounds. The ski erg hits posterior chain without excessive spinal loading after deadlifts. Keep breathing controlled.",
      "coachingNotes": "Deadlift is your weakest lift relative to your goals. We're building volume here to develop work capacity and technical consistency. The 5x4 scheme allows quality reps without excessive fatigue. Romanian deadlifts and single-leg RDLs address hamstring strength - a common weak point in the deadlift. All the pulling volume keeps your back strong and healthy. If you're still sore from squats yesterday, this might feel heavy - that's the point of accumulation phase. Push through if form stays solid.",
      "prescribedExercises": [
        {
          "exerciseName": "Deadlift",
          "movementType": "barbell"
        },
        {
          "exerciseName": "Romanian Deadlift",
          "movementType": "barbell"
        },
        {
          "exerciseName": "Single-Leg Romanian Deadlift",
          "movementType": "dumbbell"
        },
        {
          "exerciseName": "Pull-ups",
          "movementType": "gymnastics"
        },
        {
          "exerciseName": "Ski Erg",
          "movementType": "cardio"
        }
      ],
      "status": "pending",
      "completedAt": null,
      "linkedWorkoutId": null,
      "userFeedback": null,
      "adaptationHistory": []
    },
    {
      "templateId": "template_day11_primary",
      "dayNumber": 11,
      "templateType": "primary",
      "templatePriority": 1,
      "scheduledDate": "",
      "phaseId": "phase_2",
      "name": "Upper Body Pressing - Push Press & Accessory Volume",
      "description": "Push press volume work respecting shoulder limitations, followed by pressing accessories and conditioning finisher.",
      "estimatedDuration": 55,
      "requiredEquipment": [
        "barbell",
        "squat rack",
        "dumbbells",
        "medicine ball",
        "assault bike"
      ],
      "workoutContent": "Warmup (12 minutes):\nShoulder mobility sequence: band pull-aparts 20 reps, PVC pass-throughs 15 reps, wall slides 15 reps, scapular push-ups 15 reps. Light dumbbell press 15 reps. Empty barbell push press 2x10. Thoracic extensions on foam roller 90 seconds. Your shoulders need extra prep today.\n\nStrength Block:\nPush Press 5x4 @ 140lbs (building from ~155x3 estimated max)\nUp from 135lbs last week. Focus on the dip-drive timing. Dip straight down 4-6 inches, explode up, press the bar overhead. Don't press the bar until your legs have fully extended. Finish with bar over mid-foot, not in front. Your shoulder mobility limits how far back you can get the bar - that's fine, just get it as far back as comfortable. Rest 3 minutes between sets.\n\nScale: If shoulder feels tweaky or you can't maintain position, drop to 135lbs. We're not forcing overhead work with your restrictions.\n\nDumbbell Floor Press 4x10 @ 65lb dumbbells\nThis is shoulder-friendly pressing. Lie on floor, elbows touch ground each rep, press up. Full lockout at top. Rest 2 minutes between sets. This builds lockout strength without the shoulder stress of full ROM pressing.\n\nDumbbell Shoulder Press (Neutral Grip) 3x12 @ 45lb dumbbells\nSeated or standing, neutral grip (palms facing each other). This grip is easier on your shoulders. Press to lockout, control the descent. Rest 90 seconds between sets.\n\nTricep Work:\nClose-Grip Push-ups 3x15\nHands directly under shoulders, elbows tight to body. If you can't get 15, do as many as possible then finish on knees. Rest 60 seconds between sets.\n\nConditioning Finisher:\nEMOM 10 minutes:\nOdd minutes: 15 wall balls @ 20lb medicine ball (10-foot target)\nEven minutes: 12 calories assault bike\n\nModerate intensity. Wall balls should be unbroken. Bike should finish with 20+ seconds rest. This keeps conditioning capacity without destroying you for tomorrow.",
      "coachingNotes": "Push press volume with your shoulder restrictions requires smart progression. We're using leg drive to reduce shoulder ROM demands. The floor press and neutral grip dumbbell work are shoulder-friendly pressing variations that still build strength. Tricep work supports your bench press lockout. Don't push overhead ROM beyond what's comfortable - we're working within your limitations, not fighting them. If anything feels off in your shoulder, stop immediately.",
      "prescribedExercises": [
        {
          "exerciseName": "Push Press",
          "movementType": "barbell"
        },
        {
          "exerciseName": "Dumbbell Floor Press",
          "movementType": "dumbbell"
        },
        {
          "exerciseName": "Dumbbell Shoulder Press",
          "movementType": "dumbbell"
        },
        {
          "exerciseName": "Wall Ball",
          "movementType": "other"
        },
        {
          "exerciseName": "Assault Bike",
          "movementType": "cardio"
        }
      ],
      "status": "pending",
      "completedAt": null,
      "linkedWorkoutId": null,
      "userFeedback": null,
      "adaptationHistory": []
    },
    {
      "templateId": "template_day12_primary",
      "dayNumber": 12,
      "templateType": "primary",
      "templatePriority": 1,
      "scheduledDate": "",
      "phaseId": "phase_2",
      "name": "Full Body Strength - Squat Variation & Pulling Volume",
      "description": "Front squat variation work to build quad strength and address squat weakness, followed by heavy pulling and conditioning finisher.",
      "estimatedDuration": 60,
      "requiredEquipment": [
        "barbell",
        "squat rack",
        "dumbbells",
        "pull-up bar",
        "rowing machine",
        "box"
      ],
      "workoutContent": "Warmup (12 minutes):\nHip circles, leg swings, deep squat holds, thoracic rotations, light front squats with empty bar 2x10. Wrist stretches - front rack position can be tough. Get mobile.\n\nStrength Block:\nFront Squat 5x5 @ 165lbs (lighter than back squat, different stimulus)\nFront squats force upright torso and hit your quads hard. Bar in front rack position (or crossed-arm grip if wrists are tight). Elbows high throughout the movement. Descend controlled, drive up explosively. Your back squat weakness often comes from quad strength - this addresses it. Rest 3 minutes between sets.\n\nScale: If front rack position bothers your wrists/shoulders, use crossed-arm grip or goblet squats @ 70lb dumbbell for 5x10.\n\nWeighted Pull-ups 5x5 @ 35lb plate\nWe're adding weight from earlier this week. Strict reps, dead hang to chin over bar. Rest 3 minutes between sets. If you can't get 5 reps, reduce weight to 25lbs.\n\nPendlay Rows 4x8 @ 155lbs\nExplosive rows from dead stop on floor each rep. Pull to lower chest, control descent back to floor. Rest 2 minutes between sets. This builds explosive pulling power.\n\nLunges 3x10 each leg @ 50lb dumbbells\nWalking lunges if space allows, otherwise alternating reverse lunges. You're strong on lunges - let's use that. Rest 90 seconds between sets.\n\nCore Work:\nPlank Hold 3x45 seconds\nStrict hollow body position, squeeze glutes, don't let hips sag. Rest 60 seconds between sets.\n\nConditioning Finisher:\n4 Rounds For Time (15-minute cap):\n250m row\n15 box jumps @ 24-inch box (step down)\n20 Russian kettlebell swings @ 53lbs\n\nModerate pace, aim to finish in 11-13 minutes. Box jumps are for power, not speed - full hip extension at top, step down safely. This hits legs without excessive loading after front squats.",
      "coachingNotes": "Front squats are a game-changer for back squat development. They force quad engagement and upright posture. If the front rack position is uncomfortable with your shoulder mobility, use the crossed-arm grip or switch to heavy goblet squats - still hits quads hard. The heavy pulling volume (weighted pull-ups and Pendlay rows) builds back strength to support your deadlift. Lunges leverage your existing strength. This is Day 5 of your training week - you should be feeling accumulated fatigue. That's the point. Push through with discipline.",
      "prescribedExercises": [
        {
          "exerciseName": "Front Squat",
          "movementType": "barbell"
        },
        {
          "exerciseName": "Weighted Pull-ups",
          "movementType": "gymnastics"
        },
        {
          "exerciseName": "Pendlay Row",
          "movementType": "barbell"
        },
        {
          "exerciseName": "Lunges",
          "movementType": "dumbbell"
        },
        {
          "exerciseName": "Rowing Machine",
          "movementType": "cardio"
        },
        {
          "exerciseName": "Box Jump",
          "movementType": "other"
        }
      ],
      "status": "pending",
      "completedAt": null,
      "linkedWorkoutId": null,
      "userFeedback": null,
      "adaptationHistory": []
    },
    {
      "templateId": "template_day13_primary",
      "dayNumber": 13,
      "templateType": "primary",
      "templatePriority": 1,
      "scheduledDate": "",
      "phaseId": "phase_2",
      "name": "Longer Conditioning - Mixed Modality Work Capacity",
      "description": "Extended conditioning session to build aerobic capacity and work capacity without compromising strength recovery.",
      "estimatedDuration": 30,
      "requiredEquipment": [
        "assault bike",
        "rowing machine",
        "kettlebell",
        "pull-up bar",
        "box"
      ],
      "workoutContent": "Warmup (8 minutes):\nEasy 3-minute bike spin, arm circles, leg swings, hip openers, light kettlebell swings 15 reps, 5 easy pull-ups. Get the body moving without taxing it.\n\nConditioning Work:\n25-Minute AMRAP (As Many Rounds As Possible):\n10 calories assault bike\n10 kettlebell swings @ 53lbs\n10 box step-ups @ 20-inch box (5 each leg, alternating)\n5 pull-ups (strict or kipping, your choice)\n\nThis is about sustainable pace over 25 minutes. You're building aerobic capacity and work capacity here. Aim for 8-10 rounds total. Pace should be conversational for the first 15 minutes, then you can push the last 10 minutes if you're feeling good. Don't sprint - this is about time under tension and maintaining output.\n\nScale: If pull-ups become impossible, switch to jumping pull-ups or ring rows. If bike calories take longer than 45 seconds, reduce to 8 calories. The goal is continuous movement with minimal rest.\n\nCooldown (5 minutes):\nEasy 2-minute row or bike spin, couch stretch 90 seconds each side, pigeon pose 60 seconds each side, child's pose 90 seconds.\n\nMobility Focus (Optional, 10 minutes):\nSince this is your lighter day, spend extra time on mobility:\n- Thoracic extensions on foam roller: 2 minutes\n- Shoulder pass-throughs with band: 20 reps\n- Deep squat hold: 2 minutes total (break into chunks)\n- Hip flexor stretches: 90 seconds each side\n- Foam roll quads, hamstrings, glutes: 5 minutes total\n\nYou don't do enough of this stuff - today's the day to prioritize it.",
      "coachingNotes": "This is your longer conditioning day - it's meant to build aerobic capacity without destroying you for next week. The 25-minute AMRAP format keeps you moving continuously at moderate intensity. This is NOT a sprint. If you're gasping for air, you're going too hard. Think 65-70% effort for the first 15 minutes, then 75-80% for the last 10 if you've got gas in the tank. The optional mobility work is highly recommended - you're accumulating fatigue from this week's volume, and mobility work will help you recover better. Tomorrow is complete rest - take it seriously.",
      "prescribedExercises": [
        {
          "exerciseName": "Assault Bike",
          "movementType": "cardio"
        },
        {
          "exerciseName": "Kettlebell Swing",
          "movementType": "kettlebell"
        },
        {
          "exerciseName": "Box Step-up",
          "movementType": "other"
        },
        {
          "exerciseName": "Pull-ups",
          "movementType": "gymnastics"
        }
      ],
      "status": "pending",
      "completedAt": null,
      "linkedWorkoutId": null,
      "userFeedback": null,
      "adaptationHistory": []
    },
    {
      "templateId": "template_day14_optional",
      "dayNumber": 14,
      "templateType": "optional",
      "templatePriority": 2,
      "scheduledDate": "",
      "phaseId": "phase_2",
      "name": "Complete Rest & Recovery",
      "description": "Full rest day for physical and mental recovery after high-volume training week.",
      "estimatedDuration": 20,
      "requiredEquipment": [
        "foam roller",
        "resistance bands"
      ],
      "workoutContent": "Complete Rest Day - No Training\n\nThis is your mandatory rest day. After 6 days of training with increased volume this week, your body needs recovery time. Rest is when adaptation happens - you don't get stronger during workouts, you get stronger during recovery.\n\nOptional Recovery Activities (Low Intensity Only):\n\n1. Mobility & Stretching Routine (15-20 minutes):\n   - Foam roll: quads, hamstrings, glutes, upper back (2 minutes each area)\n   - Couch stretch: 2 minutes each side (hip flexor mobility)\n   - Pigeon pose: 90 seconds each side (hip mobility)\n   - Thoracic extensions on foam roller: 3 minutes\n   - Shoulder pass-throughs with band: 20 reps\n   - Deep squat hold: 2 minutes total\n   - Child's pose: 2 minutes\n\n2. Light Walking (Optional):\n   - Easy 20-30 minute walk at conversational pace\n   - Gets blood flowing without taxing recovery\n   - Mental break from training\n\n3. Sleep Priority:\n   - Aim for 7-8 hours tonight (I know you're only getting 5-6)\n   - Quality sleep is the most important recovery tool you have\n   - At 52, sleep is non-negotiable for adaptation\n\nWhat NOT To Do:\n- No lifting, no conditioning, no 'light workout'\n- No running or high-impact activity\n- No testing movements or 'just seeing how things feel'\n- Don't turn this into a training day\n\nRecovery Checklist:\n- Adequate protein intake (aim for 180-200g today)\n- Hydration (half your bodyweight in ounces minimum)\n- Mobility work (at least 15 minutes)\n- Quality sleep (7-8 hours)\n- Mental rest from training\n\nYou've completed 2 weeks of volume accumulation. Week 3 continues building before we deload in Week 4. Your body needs this rest to adapt to the increased training stress. Take it seriously.",
      "coachingNotes": "This is non-negotiable rest. You're 52 years old and accumulating fatigue from increased volume. Rest days are when your body rebuilds stronger. The optional mobility work is highly recommended since you don't do enough stretching or foam rolling normally. If you feel the urge to train, remind yourself that discipline includes knowing when to rest. Next week we continue volume accumulation before a deload week. Use today to prepare mentally for Week 3.",
      "prescribedExercises": [],
      "status": "pending",
      "completedAt": null,
      "linkedWorkoutId": null,
      "userFeedback": null,
      "adaptationHistory": []
    },
    {
      "templateId": "template_day15_primary",
      "dayNumber": 15,
      "templateType": "primary",
      "templatePriority": 1,
      "scheduledDate": "",
      "phaseId": "phase_3",
      "name": "Lower Body Strength - Heavy Squat Day",
      "description": "Reduced volume, increased intensity on back squat with supporting unilateral work and conditioning finisher.",
      "estimatedDuration": 55,
      "requiredEquipment": [
        "barbell",
        "squat rack",
        "dumbbells",
        "assault bike"
      ],
      "workoutContent": "Warmup (12 minutes):\nHip circles 2x10 each direction, leg swings front/back and side/side 10 each, deep squat holds 3x20 seconds, PVC pass-throughs 15 reps, goblet squats 2x8 with 25lb dumbbell. Get those hips and shoulders ready - we're going heavy today.\n\nStrength Block:\nBack Squat 4x3 @ 225lbs (82% of estimated 1RM ~275lbs)\nThis is heavy work. Four sets of three quality reps. Rest 4 minutes between sets - you need full recovery here. Focus on hitting depth consistently every single rep. Feel your weight shift to mid-foot at the bottom. Keep your chest up through the entire movement. Film your heaviest set if possible - I want to see depth and bar path.\n\nScale: If form breaks on any rep, reduce weight by 10lbs immediately. Quality over ego.\n\nBulgarian Split Squat 3x8 each leg @ 50lb dumbbells\nEight reps per leg, not ten. We're reducing volume but keeping intensity. Focus on front leg doing 90% of the work. Keep torso upright, don't lean forward. Control the descent, drive through the heel. Rest 2 minutes between sets.\n\nConditioning Finisher:\nEMOM 12:\nMinute 1: 12 calories assault bike\nMinute 2: 15 kettlebell swings @ 53lbs\nMinute 3: 20 air squats\nRepeat 4 rounds total.\n\nModerate intensity - you should finish each movement with 15-20 seconds rest. This is active recovery after heavy squats, not a sprint. Keep breathing controlled and rhythm steady.",
      "coachingNotes": "Week 3 intensification - we're dropping volume (4x3 instead of 5x5) but increasing load. This is where we build neural adaptation for max testing next week. Recovery is critical - don't skip the 4-minute rest between squat sets. If you're feeling beat up from the first two weeks, this reduced volume should feel manageable despite the heavier weight. The conditioning finisher is deliberately moderate - we're not trying to crush you here, just maintain work capacity.",
      "prescribedExercises": [
        {
          "exerciseName": "Back Squat",
          "movementType": "barbell"
        },
        {
          "exerciseName": "Bulgarian Split Squat",
          "movementType": "dumbbell"
        },
        {
          "exerciseName": "Assault Bike",
          "movementType": "cardio"
        },
        {
          "exerciseName": "Kettlebell Swing",
          "movementType": "kettlebell"
        }
      ],
      "status": "pending",
      "completedAt": null,
      "linkedWorkoutId": null,
      "userFeedback": null,
      "adaptationHistory": []
    },
    {
      "templateId": "template_day16_primary",
      "dayNumber": 16,
      "templateType": "primary",
      "templatePriority": 1,
      "scheduledDate": "",
      "phaseId": "phase_3",
      "name": "Upper Body Strength - Heavy Bench Press",
      "description": "High-intensity bench press work with reduced volume, plus pulling strength and short conditioning piece.",
      "estimatedDuration": 60,
      "requiredEquipment": [
        "barbell",
        "bench press",
        "pull-up bar",
        "dumbbells",
        "rowing machine"
      ],
      "workoutContent": "Warmup (10 minutes):\nArm circles 2x10 each direction, band pull-aparts 2x15, scapular push-ups 2x10, empty bar bench press 2x10 focusing on bar path, light dumbbell rows 2x12 @ 25lbs each. Get the shoulders and upper back warm and mobile.\n\nStrength Block:\nBench Press 5x2 @ 235lbs (85% of estimated 1RM ~275lbs)\nFive sets of two reps. This is serious weight - heavier than you've touched in this program so far. Rest 4 minutes between sets. Focus on leg drive from the start, maintain your arch, control the descent, explode up. Bar path should be slight arc from chest to over shoulders. Each rep should look identical. Film a set if you can - I want to see consistency.\n\nScale: If you miss a rep or form breaks, reduce to 225lbs.\n\nWeighted Pull-Ups 4x4 @ 25lbs\nFour sets of four reps with a 25lb dumbbell or plate. Full range of motion - chin over bar at top, arms fully extended at bottom. Rest 3 minutes between sets. If you can't get four reps with 25lbs, reduce weight or go bodyweight.\n\nClose-Grip Bench Press 3x6 @ 185lbs\nTricep and lockout strength work. Hands shoulder-width apart. Control the descent, powerful lockout. Rest 2 minutes between sets.\n\nDumbbell Rows 3x10 each arm @ 70lbs\nTen reps per arm. Pull to hip, squeeze at the top, control the descent. Rest 90 seconds between sets.\n\nConditioning Finisher:\n3 Rounds:\n300m row\n15 push-ups\n\nModerate pace on the row - around 1:50-2:00/500m split. Push-ups should be unbroken or max 2 sets. This should take 8-10 minutes total. Not a race, just maintaining conditioning.",
      "coachingNotes": "This is your heaviest bench press work of the program before max testing. 235lbs for doubles should feel challenging but manageable - you hit 255x3 recently, so this is about 85%. The reduced volume (5x2 vs 5x5 in earlier weeks) allows for higher intensity. Weighted pull-ups and rows provide balanced pulling volume to keep shoulders healthy. The close-grip bench targets your lockout strength which will help on max day. Conditioning finisher is deliberately short - we're prioritizing recovery for tomorrow's deadlift work.",
      "prescribedExercises": [
        {
          "exerciseName": "Bench Press",
          "movementType": "barbell"
        },
        {
          "exerciseName": "Weighted Pull-Up",
          "movementType": "bodyweight"
        },
        {
          "exerciseName": "Close-Grip Bench Press",
          "movementType": "barbell"
        },
        {
          "exerciseName": "Dumbbell Row",
          "movementType": "dumbbell"
        },
        {
          "exerciseName": "Rowing Machine",
          "movementType": "cardio"
        }
      ],
      "status": "pending",
      "completedAt": null,
      "linkedWorkoutId": null,
      "userFeedback": null,
      "adaptationHistory": []
    },
    {
      "templateId": "template_day17_primary",
      "dayNumber": 17,
      "templateType": "primary",
      "templatePriority": 1,
      "scheduledDate": "",
      "phaseId": "phase_3",
      "name": "Posterior Chain - Heavy Deadlift Day",
      "description": "Peak intensity deadlift work with minimal volume, plus accessory pulling and conditioning.",
      "estimatedDuration": 65,
      "requiredEquipment": [
        "barbell",
        "deadlift platform",
        "dumbbells",
        "pull-up bar",
        "ski erg"
      ],
      "workoutContent": "Warmup (15 minutes):\nThis is your most important warmup of the week. Cat-cow stretches 2x10, hip flexor stretches 2x30 seconds each side, hamstring scoops 2x10, glute bridges 2x15, Romanian deadlifts with empty bar 2x10, light deadlifts building up: 135x5, 185x3, 225x2, 255x1. Take your time here - your back needs to be ready.\n\nStrength Block:\nDeadlift 5x2 @ 265lbs (88% of estimated 1RM ~300lbs, conservative for Week 3)\nFive sets of two reps at 265lbs. This is the heaviest deadlift work before max testing next week. Rest 5 minutes between sets - full recovery is non-negotiable. Setup checklist every rep: feet hip-width, bar over mid-foot, shoulders slightly in front of bar, chest up, lats engaged, feel tension in hamstrings before you pull, drive through the floor. Film your heaviest set - I need to see hip timing and bar path.\n\nScale: If your hips shoot up early or your back rounds, reduce to 255lbs immediately. Form is everything here.\n\nRomanian Deadlift 3x6 @ 185lbs\nSix reps focusing on hamstring stretch and hip hinge pattern. Bar stays close to legs entire movement. Control the descent, powerful hip drive up. Rest 2 minutes between sets.\n\nPull-Ups 4x6 bodyweight\nSix reps, four sets. Full range of motion. If you can't get six, do as many as possible then band-assisted for remaining reps. Rest 2 minutes between sets.\n\nConditioning Finisher:\nEMOM 10:\nOdd minutes: 15 calories ski erg\nEven minutes: 12 alternating dumbbell snatches @ 50lbs\n\nModerate intensity. Ski erg should take 35-45 seconds, snatches should be smooth and controlled. This is active recovery, not a sprint. Keep your heart rate in check.",
      "coachingNotes": "This is it - your peak deadlift intensity before we test maxes next week. 265lbs for doubles at 88% should feel heavy but controlled. We're being slightly conservative here (not pushing to 90%+) because I want you fresh for max testing, and your deadlift is a weak point we're addressing. The extended warmup is critical - don't rush it. Romanian deadlifts reinforce the hip hinge pattern and build hamstring strength for the pull. Conditioning is deliberately moderate - we're not trying to trash your posterior chain before max week.",
      "prescribedExercises": [
        {
          "exerciseName": "Deadlift",
          "movementType": "barbell"
        },
        {
          "exerciseName": "Romanian Deadlift",
          "movementType": "barbell"
        },
        {
          "exerciseName": "Pull-Up",
          "movementType": "bodyweight"
        },
        {
          "exerciseName": "Ski Erg",
          "movementType": "cardio"
        },
        {
          "exerciseName": "Dumbbell Snatch",
          "movementType": "dumbbell"
        }
      ],
      "status": "pending",
      "completedAt": null,
      "linkedWorkoutId": null,
      "userFeedback": null,
      "adaptationHistory": []
    },
    {
      "templateId": "template_day18_primary",
      "dayNumber": 18,
      "templateType": "primary",
      "templatePriority": 1,
      "scheduledDate": "",
      "phaseId": "phase_3",
      "name": "Upper Body Power - Heavy Push Press",
      "description": "Peak intensity push press work with shoulder-friendly accessory movements and conditioning finisher.",
      "estimatedDuration": 55,
      "requiredEquipment": [
        "barbell",
        "squat rack",
        "dumbbells",
        "pull-up bar",
        "assault bike"
      ],
      "workoutContent": "Warmup (12 minutes):\nShoulder mobility focus: arm circles 2x10 each direction, band pull-aparts 2x20, PVC pass-throughs 15 reps (within your ROM), scapular wall slides 2x10, empty bar push press 2x10 focusing on dip and drive timing. Light dumbbell overhead press 2x8 @ 25lbs (only to comfortable ROM). Get shoulders warm and mobile within your limitations.\n\nStrength Block:\nPush Press 5x2 @ 155lbs (85% of estimated 1RM ~185lbs)\nFive sets of two reps. This is heavy push press work - focus on explosive leg drive and timing. Dip depth should be 4-6 inches, vertical torso, drive through heels, aggressive press overhead. Only press to YOUR comfortable overhead position - don't force full lockout if shoulder mobility limits you. Rest 3-4 minutes between sets.\n\nScale: If shoulder discomfort or form breaks, reduce to 145lbs.\n\nIncline Dumbbell Press 3x8 @ 60lbs each\nEight reps at 45-degree incline. This is shoulder-friendly pressing volume. Full range of motion that feels comfortable - don't force excessive ROM. Control descent, powerful press. Rest 2 minutes between sets.\n\nStrict Pull-Ups 4x5 bodyweight\nFive reps, four sets. Slow and controlled - no kip. Pull to chin over bar, lower to full extension. Rest 2 minutes. If you can't get five strict, do max effort then band-assisted.\n\nDumbbell Lateral Raises 3x12 @ 20lbs each\nTwelve reps focusing on lateral delt. Slight forward lean, raise to shoulder height, control the descent. Rest 90 seconds between sets.\n\nConditioning Finisher:\nAMRAP 10 minutes:\n10 calories assault bike\n10 dumbbell push press @ 35lbs each\n10 sit-ups\n\nSteady pace - aim for 4-5 rounds. This should feel like moderate intensity, not a sprint. The dumbbell push press is light - focus on rhythm and breathing.",
      "coachingNotes": "Week 3 intensification on push press - 155lbs for doubles is 85% of your estimated max. The key here is leg drive timing and explosiveness, not grinding through shoulder strength. Respect your shoulder mobility limitations - press to YOUR comfortable overhead position. The incline press provides additional pressing volume in a shoulder-friendly position. Lateral raises target side delts which often lag in pressing-focused programs. Conditioning finisher uses light dumbbells to maintain movement quality while tired.",
      "prescribedExercises": [
        {
          "exerciseName": "Push Press",
          "movementType": "barbell"
        },
        {
          "exerciseName": "Incline Dumbbell Press",
          "movementType": "dumbbell"
        },
        {
          "exerciseName": "Strict Pull-Up",
          "movementType": "bodyweight"
        },
        {
          "exerciseName": "Dumbbell Lateral Raise",
          "movementType": "dumbbell"
        },
        {
          "exerciseName": "Assault Bike",
          "movementType": "cardio"
        },
        {
          "exerciseName": "Dumbbell Push Press",
          "movementType": "dumbbell"
        }
      ],
      "status": "pending",
      "completedAt": null,
      "linkedWorkoutId": null,
      "userFeedback": null,
      "adaptationHistory": []
    },
    {
      "templateId": "template_day19_primary",
      "dayNumber": 19,
      "templateType": "primary",
      "templatePriority": 1,
      "scheduledDate": "",
      "phaseId": "phase_3",
      "name": "Full Body Strength - Front Squat Variation",
      "description": "Lower volume full body strength work with front squat emphasis, accessory movements, and conditioning.",
      "estimatedDuration": 60,
      "requiredEquipment": [
        "barbell",
        "squat rack",
        "dumbbells",
        "pull-up bar",
        "rowing machine"
      ],
      "workoutContent": "Warmup (10 minutes):\nHip circles 2x10 each direction, leg swings 10 each direction, deep squat holds 2x20 seconds, front rack stretches 2x30 seconds, empty bar front squats 2x8 focusing on upright torso, light goblet squats 2x10 @ 25lb dumbbell.\n\nStrength Block:\nFront Squat 4x4 @ 175lbs (70% of back squat working max)\nFour sets of four reps. Front squats are less fatiguing than back squats but still build leg strength and reinforce upright torso position. Elbows high, chest up, core tight. Rest 3 minutes between sets. If you've never front squatted or it's been a while, start at 155lbs and work up.\n\nScale: If wrist or shoulder mobility limits front rack position, use cross-arm grip or substitute goblet squats @ 70lb dumbbell for 4x8.\n\nWeighted Pull-Ups 4x3 @ 35lbs\nThree reps, four sets, heavier than Day 16. Full ROM. Rest 3 minutes between sets. If you can't get three reps with 35lbs, reduce to 25lbs.\n\nDumbbell Romanian Deadlift 3x10 @ 60lbs each\nTen reps focusing on hamstring stretch and hip hinge. Bar stays close to legs, control the descent. Rest 2 minutes between sets.\n\nDumbbell Bench Press 3x8 @ 70lbs each\nEight reps with dumbbells. Full ROM, control the descent, press with power. Rest 2 minutes between sets.\n\nConditioning Finisher:\n4 Rounds:\n250m row\n15 dumbbell thrusters @ 35lbs each\n\nModerate pace - should take 10-12 minutes total. Row at sustainable pace (around 1:55-2:05/500m), thrusters should be unbroken or max 2 sets. This is conditioning work, not a sprint.",
      "coachingNotes": "Day 5 full body work with reduced volume for Week 3 intensification. Front squats provide leg stimulus without the same systemic fatigue as heavy back squats - important as we approach max testing week. The movement also reinforces upright torso position which transfers to your back squat. Weighted pull-ups are heavier than Day 16 (35lbs vs 25lbs) but fewer reps. Romanian deadlifts maintain posterior chain work without the intensity of full deadlifts. Dumbbell bench provides pressing volume with less shoulder stress than barbell. Conditioning finisher combines rowing and thrusters for full-body metabolic work.",
      "prescribedExercises": [
        {
          "exerciseName": "Front Squat",
          "movementType": "barbell"
        },
        {
          "exerciseName": "Weighted Pull-Up",
          "movementType": "bodyweight"
        },
        {
          "exerciseName": "Dumbbell Romanian Deadlift",
          "movementType": "dumbbell"
        },
        {
          "exerciseName": "Dumbbell Bench Press",
          "movementType": "dumbbell"
        },
        {
          "exerciseName": "Rowing Machine",
          "movementType": "cardio"
        },
        {
          "exerciseName": "Dumbbell Thruster",
          "movementType": "dumbbell"
        }
      ],
      "status": "pending",
      "completedAt": null,
      "linkedWorkoutId": null,
      "userFeedback": null,
      "adaptationHistory": []
    },
    {
      "templateId": "template_day20_primary",
      "dayNumber": 20,
      "templateType": "primary",
      "templatePriority": 1,
      "scheduledDate": "",
      "phaseId": "phase_3",
      "name": "Longer Conditioning - CrossFit Style Chipper",
      "description": "Extended conditioning session with varied movements to maintain work capacity before max testing week.",
      "estimatedDuration": 30,
      "requiredEquipment": [
        "rowing machine",
        "dumbbells",
        "box",
        "pull-up bar",
        "kettlebell",
        "medicine ball"
      ],
      "workoutContent": "Warmup (8 minutes):\nLight row 2 minutes easy pace, arm circles 2x10 each direction, leg swings 10 each direction, air squats 2x10, push-ups 2x8, jumping jacks 30 seconds. Get the heart rate up gradually.\n\nMain Conditioning Work:\nFor Time (25 minute cap):\n1000m row\n50 dumbbell box step-ups @ 35lbs each (20-inch box, alternating legs)\n40 kettlebell swings @ 53lbs\n30 pull-ups (scale: band-assisted or jumping)\n20 dumbbell thrusters @ 35lbs each\n10 wall ball shots @ 20lbs (10-foot target)\n\nThis is a chipper - work through the movements in order, one time through. Pace yourself intelligently. The row should be moderate intensity (around 2:00-2:10/500m split). Break up the step-ups into manageable sets - maybe 10-15 at a time. Kettlebell swings should be sets of 10-15. Pull-ups will likely need to be broken up significantly - that's fine. Thrusters and wall balls are the burnout at the end - embrace the suck.\n\nTarget time: 20-25 minutes. If you hit the 25-minute cap, note where you finished.\n\nScale: If this looks too long, reduce to: 750m row, 40 step-ups, 30 swings, 20 pull-ups, 15 thrusters, 10 wall balls.\n\nCooldown (5 minutes):\nWalk 2-3 minutes, light stretching focusing on legs and shoulders, foam roll if available.",
      "coachingNotes": "This is your longer conditioning day for Week 3 - a classic CrossFit-style chipper that tests work capacity across varied time domain and movements. The total volume is moderate (not trying to crush you before max testing week), but the variety and continuous work will challenge your conditioning. Pacing is critical - if you go too hard on the row, you'll pay for it on the step-ups. Break movements into sustainable sets rather than going to failure. This workout maintains your conditioning capacity without compromising strength recovery. You should feel worked but not destroyed - if you're completely wrecked, you went too hard.",
      "prescribedExercises": [
        {
          "exerciseName": "Rowing Machine",
          "movementType": "cardio"
        },
        {
          "exerciseName": "Dumbbell Box Step-Up",
          "movementType": "dumbbell"
        },
        {
          "exerciseName": "Kettlebell Swing",
          "movementType": "kettlebell"
        },
        {
          "exerciseName": "Pull-Up",
          "movementType": "bodyweight"
        },
        {
          "exerciseName": "Dumbbell Thruster",
          "movementType": "dumbbell"
        },
        {
          "exerciseName": "Wall Ball",
          "movementType": "other"
        }
      ],
      "status": "pending",
      "completedAt": null,
      "linkedWorkoutId": null,
      "userFeedback": null,
      "adaptationHistory": []
    },
    {
      "templateId": "template_day21_primary",
      "dayNumber": 21,
      "templateType": "optional",
      "templatePriority": 2,
      "scheduledDate": "",
      "phaseId": "phase_3",
      "name": "Active Recovery - Mobility & Stretching",
      "description": "Complete rest day with optional mobility work to prepare for max testing week.",
      "estimatedDuration": 20,
      "requiredEquipment": [
        "foam roller",
        "resistance bands"
      ],
      "workoutContent": "REST DAY - No Training\n\nThis is your mandatory rest day before we enter max testing week. You've completed three weeks of progressive overload with increasing intensity. Your body needs this recovery day to adapt and prepare for next week's PR attempts.\n\nOptional Mobility Work (20 minutes if you're feeling tight):\n\nShoulder Mobility Circuit (8 minutes):\n- Band pull-aparts 2x20\n- PVC pass-throughs 2x15 (within your comfortable ROM)\n- Doorway chest stretches 2x45 seconds each side\n- Wall slides 2x12\n- Thread the needle stretch 2x30 seconds each side\n\nHip & Lower Body Mobility (8 minutes):\n- Hip flexor stretches 2x45 seconds each side\n- Pigeon pose 2x60 seconds each side\n- Deep squat hold 3x30 seconds\n- Hamstring stretches 2x45 seconds each side\n\nFoam Rolling (4 minutes):\n- Thoracic spine 90 seconds\n- Lats 60 seconds each side\n- Quads 60 seconds each leg\n- IT band 60 seconds each leg\n\nAlternatively: Go for an easy 15-20 minute walk, do some light stretching, or do absolutely nothing. All are valid choices today.\n\nMental Preparation:\nNext week is max testing week - the culmination of this 4-week block. Review your goals: 315lb deadlift, 275lb squat, 315lb bench, 185lb push press. Visualize successful lifts. Get your sleep dialed in this week. Eat well. Show up ready to perform.",
      "coachingNotes": "This is non-negotiable rest before max testing week. Do not train today. If you feel the urge to do something, the optional mobility work is fine, but nothing intense. Your body is adapting to three weeks of progressive overload - let it happen. Sleep is your priority today. Aim for 7-8 hours if possible (I know you're averaging 5-6, but try). Hydrate well. Eat quality food. Mentally prepare for next week's max attempts. This rest day is as important as any training day.",
      "prescribedExercises": [],
      "status": "pending",
      "completedAt": null,
      "linkedWorkoutId": null,
      "userFeedback": null,
      "adaptationHistory": []
    },
    {
      "templateId": "template_day22_primary",
      "dayNumber": 22,
      "templateType": "primary",
      "templatePriority": 1,
      "scheduledDate": "",
      "phaseId": "phase_4",
      "name": "Deload Day 1 - Active Recovery Lower Body",
      "description": "Light lower body work to dissipate fatigue and prepare for max testing later this week.",
      "estimatedDuration": 45,
      "requiredEquipment": [
        "barbell",
        "squat rack",
        "dumbbells",
        "foam roller",
        "resistance bands"
      ],
      "workoutContent": "Warmup (15 minutes):\nToday we start the deload. Your body needs this - we've been pushing hard for three weeks. Take your time warming up.\n\nFoam roll: quads, hamstrings, glutes, calves (5 minutes)\nDynamic warmup: leg swings, hip circles, deep squat holds, walking lunges, PVC pass-throughs\nMobility focus: hip flexor stretch, pigeon pose, thoracic extensions on foam roller\n\nDeload Strength Work:\nBack Squat 3x5 @ 185lbs (60% of estimated max)\nThis should feel EASY. Focus purely on movement quality and depth consistency. Feel your weight shift to mid-foot at the bottom. Keep your chest up throughout. These are technical practice reps, not a grind. Rest 2 minutes between sets.\n\nRomanian Deadlift 3x8 @ 135lbs\nLight posterior chain work. Focus on the hamstring stretch at the bottom. Keep your back flat, chest up. Feel the tension in your hamstrings before you pull back up. Rest 90 seconds.\n\nGoblet Squat 2x12 @ 35lb dumbbell\nSlow and controlled. Use these to reinforce good squat mechanics. Sit deep, chest up, knees out. Rest 60 seconds.\n\nCore Work:\nPlank Hold 3x30 seconds\nDead Bugs 3x10 each side\n\nNo conditioning finisher today. This is a recovery day. Stretch for 10 minutes after: hip flexors, hamstrings, quads, glutes.",
      "coachingNotes": "First deload day - volume and intensity are significantly reduced (60% of normal work). The goal is active recovery, not fatigue. If anything feels heavy or grindy, reduce weight further. Save your energy for max testing Thursday-Saturday. Emphasize mobility work - your shoulders and upper back need attention. Sleep is critical this week - prioritize 7+ hours if possible.",
      "prescribedExercises": [
        {
          "exerciseName": "Back Squat",
          "movementType": "barbell"
        },
        {
          "exerciseName": "Romanian Deadlift",
          "movementType": "barbell"
        },
        {
          "exerciseName": "Goblet Squat",
          "movementType": "dumbbell"
        }
      ],
      "status": "pending",
      "completedAt": null,
      "linkedWorkoutId": null,
      "userFeedback": null,
      "adaptationHistory": []
    },
    {
      "templateId": "template_day23_primary",
      "dayNumber": 23,
      "templateType": "primary",
      "templatePriority": 1,
      "scheduledDate": "",
      "phaseId": "phase_4",
      "name": "Deload Day 2 - Active Recovery Upper Body",
      "description": "Light upper body work focusing on movement quality and shoulder mobility preparation.",
      "estimatedDuration": 45,
      "requiredEquipment": [
        "barbell",
        "bench press",
        "dumbbells",
        "resistance bands",
        "foam roller"
      ],
      "workoutContent": "Warmup (15 minutes):\nContinuing the deload theme. Light, easy, focused on quality.\n\nFoam roll: upper back, lats, triceps (5 minutes)\nShoulder mobility circuit: band pull-aparts, wall slides, PVC pass-throughs, arm circles\nLight cardio: 5 minutes easy rowing or assault bike\n\nDeload Strength Work:\nBench Press 3x5 @ 185lbs (60% of estimated max)\nThese should feel smooth and controlled. Focus on bar path, leg drive, maintaining your arch. Feel the bar touch your chest in the same spot every rep. No grinding. Rest 2 minutes between sets.\n\nIncline Dumbbell Press 3x8 @ 40lb dumbbells\nLight pressing work. Focus on full range of motion within your shoulder mobility limits. Control the descent, explosive press up. Rest 90 seconds.\n\nSeated Dumbbell Row 3x10 @ 50lb dumbbells\nPulling volume to balance pressing. Pull to your hip, squeeze your shoulder blade back. Control the negative. Rest 90 seconds.\n\nBand Pull-Aparts 3x20\nShoulder health work. Keep arms straight, pull band apart to chest level. Squeeze shoulder blades together. Rest 60 seconds.\n\nCore Work:\nPallof Press 3x10 each side @ light resistance band\nFocus on anti-rotation stability.\n\nNo conditioning finisher. Stretch shoulders and upper back for 10 minutes: doorway pec stretch, lat stretch, thoracic rotations.",
      "coachingNotes": "Second deload day - same philosophy as Day 1. Everything should feel easy and controlled. Your bench is a strength, so even at 60% this might feel very light - that's the point. Focus on shoulder mobility work in the warmup and cooldown. We're setting you up for a big bench max on Friday. No heroics today - save it for testing days.",
      "prescribedExercises": [
        {
          "exerciseName": "Bench Press",
          "movementType": "barbell"
        },
        {
          "exerciseName": "Incline Dumbbell Press",
          "movementType": "dumbbell"
        },
        {
          "exerciseName": "Seated Dumbbell Row",
          "movementType": "dumbbell"
        }
      ],
      "status": "pending",
      "completedAt": null,
      "linkedWorkoutId": null,
      "userFeedback": null,
      "adaptationHistory": []
    },
    {
      "templateId": "template_day24_primary",
      "dayNumber": 24,
      "templateType": "primary",
      "templatePriority": 1,
      "scheduledDate": "",
      "phaseId": "phase_4",
      "name": "Max Testing Day 1 - Deadlift 1RM",
      "description": "Establish new deadlift 1RM baseline - systematic progression to true max.",
      "estimatedDuration": 60,
      "requiredEquipment": [
        "barbell",
        "deadlift platform",
        "foam roller"
      ],
      "workoutContent": "This is it. Three weeks of work have prepared you for this moment. Today we find your true deadlift max.\n\nWarmup (20 minutes):\nTake your time. This is not the place to rush.\n\nFoam roll: glutes, hamstrings, upper back (5 minutes)\nDynamic warmup: leg swings, hip circles, deep squat holds, inchworms, spiderman lunges\nDeadlift-specific prep: light RDLs, hip hinges, cat-cows\n\nDeadlift Max Testing Protocol:\nBar x10 (just the bar, movement prep)\n135lbs x5 (feeling the movement)\n185lbs x3 (still easy, groove the pattern)\n225lbs x2 (starting to feel weight)\n255lbs x1 (last warmup, should feel solid)\n275lbs x1 (your current 3RM - this should move well)\n295lbs x1 (first PR attempt - 10lb jump)\n305lbs x1 (second PR attempt - 10lb jump)\n315lbs x1 (GOAL WEIGHT - you've got this)\n\nIf 315 moves well and you feel strong, we can attempt 320-325. If 315 is a grind, we stop there. Listen to your body.\n\nCRITICAL FORM CUES:\n- Setup: weight mid-foot, shoulders over bar, chest up, lats engaged\n- Pull: feel your chest and hips rise TOGETHER, not hips first\n- Keep the bar close to your body the entire pull\n- Lock out by driving hips through, not hyperextending back\n- If form breaks, we stop. No rounded back pulls.\n\nFILM YOUR ATTEMPTS. I want to see 275, 295, 305, and 315.\n\nRest 3-5 minutes between heavy attempts. Walk around, stay loose, stay focused.\n\nAccessory (LIGHT):\nRomanian Deadlift 2x8 @ 135lbs\nJust movement and blood flow. Nothing heavy.\n\nNo conditioning today. This was your work. Stretch hamstrings and glutes for 10 minutes.",
      "coachingNotes": "This is your first max test. Your current 3RM is 285lbs, so 315 is absolutely achievable based on strength curve projections. The key is systematic progression - don't jump too big between attempts. If you hit 315 and it feels smooth, we can go for 320-325. If it's a true max grind, we stop at 315 and celebrate. Form is non-negotiable - if your back rounds or hips shoot up early, we reduce weight. This is about finding your TRUE max with good form, not an ugly grinder. Mental game matters: visualize the lift, stay confident, trust your preparation.",
      "prescribedExercises": [
        {
          "exerciseName": "Deadlift",
          "movementType": "barbell"
        },
        {
          "exerciseName": "Romanian Deadlift",
          "movementType": "barbell"
        }
      ],
      "status": "pending",
      "completedAt": null,
      "linkedWorkoutId": null,
      "userFeedback": null,
      "adaptationHistory": []
    },
    {
      "templateId": "template_day25_primary",
      "dayNumber": 25,
      "templateType": "primary",
      "templatePriority": 1,
      "scheduledDate": "",
      "phaseId": "phase_4",
      "name": "Max Testing Day 2 - Bench Press 1RM",
      "description": "Establish new bench press 1RM baseline - your strength movement.",
      "estimatedDuration": 60,
      "requiredEquipment": [
        "barbell",
        "bench press",
        "foam roller"
      ],
      "workoutContent": "Day 2 of max testing. Bench is your strength - let's see what you've really got.\n\nWarmup (20 minutes):\nFoam roll: upper back, lats, triceps (5 minutes)\nShoulder mobility: band pull-aparts, wall slides, arm circles, PVC pass-throughs\nBench-specific prep: empty bar presses x15, focus on setup and bar path\nLight cardio: 3 minutes easy rowing to get blood flowing\n\nBench Press Max Testing Protocol:\nBar x10 (groove the movement)\n135lbs x5 (still warmup)\n185lbs x3 (feeling weight)\n225lbs x2 (getting heavier)\n245lbs x1 (last warmup)\n255lbs x1 (your current 3RM - should move smoothly)\n275lbs x1 (first PR attempt - 20lb jump)\n290lbs x1 (second PR attempt - 15lb jump)\n305lbs x1 (big milestone - 300+ club)\n315lbs x1 (GOAL WEIGHT - you're built for this)\n\nIf 315 moves clean, we can attempt 320-325. Your bench is strong - trust it.\n\nCRITICAL FORM CUES:\n- Setup: shoulder blades squeezed, arch maintained, feet driving into floor\n- Bar path: straight line from chest to lockout, not forward\n- Touch point: same spot on chest every rep (lower pec area)\n- Leg drive: push through feet as you press\n- Lockout: full elbow extension, control the bar at top\n\nFILM YOUR ATTEMPTS. I want to see 255, 275, 290, 305, 315.\n\nRest 3-5 minutes between heavy attempts. Stay tight, stay focused.\n\nAccessory (LIGHT):\nClose-Grip Bench Press 2x8 @ 135lbs\nTricep focus, light weight, just movement.\n\nDumbbell Row 2x10 @ 50lbs each\nBalance the pressing with some pulling.\n\nNo conditioning. Stretch chest, shoulders, triceps for 10 minutes.",
      "coachingNotes": "Bench is your strength - your current 3RM is 255lbs, and based on your pressing power, 315 is very achievable. You've been hitting lunges and pressing movements hard, your upper body is strong. The jumps are slightly bigger here because bench typically has a flatter strength curve than deadlift. Key is maintaining setup and bar path - don't let your arch collapse or bar drift forward. If 315 moves smoothly, we absolutely go for 320-325. This could be a big day. Mental game: you KNOW you can press heavy weight. Trust your strength.",
      "prescribedExercises": [
        {
          "exerciseName": "Bench Press",
          "movementType": "barbell"
        },
        {
          "exerciseName": "Close-Grip Bench Press",
          "movementType": "barbell"
        },
        {
          "exerciseName": "Dumbbell Row",
          "movementType": "dumbbell"
        }
      ],
      "status": "pending",
      "completedAt": null,
      "linkedWorkoutId": null,
      "userFeedback": null,
      "adaptationHistory": []
    },
    {
      "templateId": "template_day26_primary",
      "dayNumber": 26,
      "templateType": "primary",
      "templatePriority": 1,
      "scheduledDate": "",
      "phaseId": "phase_4",
      "name": "Max Testing Day 3 - Back Squat & Push Press 1RM",
      "description": "Establish new baselines on back squat and push press - complete the testing battery.",
      "estimatedDuration": 75,
      "requiredEquipment": [
        "barbell",
        "squat rack",
        "foam roller",
        "resistance bands"
      ],
      "workoutContent": "Final testing day. Two lifts today: back squat and push press. You've got this.\n\nWarmup (20 minutes):\nFoam roll: quads, glutes, hamstrings, upper back (5 minutes)\nDynamic warmup: leg swings, hip circles, deep squat holds, walking lunges\nShoulder mobility: band pull-aparts, arm circles, PVC pass-throughs\nSquat-specific: goblet squats x10, pause squats with empty bar x5\n\nBack Squat Max Testing Protocol:\nBar x10 (movement prep)\n135lbs x5 (warmup)\n185lbs x3 (feeling weight)\n215lbs x2 (getting heavier)\n235lbs x1 (last warmup)\n255lbs x1 (your current 3RM - should move well)\n265lbs x1 (first PR attempt - 10lb jump)\n275lbs x1 (GOAL WEIGHT - you're ready)\n\nIf 275 moves smoothly, we can attempt 280-285. Squat is a weak point but you've made progress.\n\nCRITICAL SQUAT CUES:\n- Depth: hit parallel or below EVERY rep - no high squats\n- Weight: mid-foot throughout, feel the balance\n- Chest up: don't let your torso fold forward\n- Knees out: track over toes, don't cave in\n- Brace: big breath, tight core before you descend\n\nFILM EVERYTHING. I need to see depth on all attempts.\n\nRest 3-5 minutes between heavy attempts.\n\nPush Press Max Testing Protocol:\n(Start after squats, take 10 minutes to rest and prep shoulders)\n\nBar x10 (movement prep)\n95lbs x5 (warmup)\n115lbs x3 (feeling weight)\n135lbs x2 (getting heavier)\n155lbs x1 (last warmup)\n165lbs x1 (your current estimated 3RM)\n175lbs x1 (first PR attempt)\n185lbs x1 (GOAL WEIGHT)\n\nIf 185 moves well, we can attempt 190-195.\n\nCRITICAL PUSH PRESS CUES:\n- Dip: shallow, vertical, fast\n- Drive: explosive leg drive transfers to bar\n- Press: aggressive lockout, use momentum\n- Position: respect your shoulder mobility - don't force full overhead if it's not there\n- Core: stay braced throughout\n\nRest 3 minutes between heavy attempts.\n\nNo accessory work today. You've done enough. Stretch for 15 minutes: hips, shoulders, upper back.",
      "coachingNotes": "Two lifts in one day is demanding but manageable. Squat first (bigger movement, more systemically taxing), then push press. Your squat is a weak point - current 3RM is 255lbs, so 275 is the target. Focus on DEPTH - no high squats on max attempts. Film everything so we can verify depth. Push press is estimated at 165x3, so 185 is achievable. The key with push press is explosive leg drive and respecting your shoulder mobility limits. Don't force overhead position if it's not there - we're testing strength, not mobility. If you feel strong after hitting goals, we can push for 280-285 squat and 190-195 push press. This completes your testing battery - you'll have new baselines to build from in the next training block.",
      "prescribedExercises": [
        {
          "exerciseName": "Back Squat",
          "movementType": "barbell"
        },
        {
          "exerciseName": "Push Press",
          "movementType": "barbell"
        }
      ],
      "status": "pending",
      "completedAt": null,
      "linkedWorkoutId": null,
      "userFeedback": null,
      "adaptationHistory": []
    },
    {
      "templateId": "template_day27_primary",
      "dayNumber": 27,
      "templateType": "primary",
      "templatePriority": 1,
      "scheduledDate": "",
      "phaseId": "phase_4",
      "name": "Active Recovery - Conditioning & Mobility",
      "description": "Light conditioning work and extensive mobility to recover from max testing week.",
      "estimatedDuration": 30,
      "requiredEquipment": [
        "assault bike",
        "rowing machine",
        "foam roller",
        "resistance bands"
      ],
      "workoutContent": "You just completed three days of max testing. Your body needs active recovery today.\n\nMobility & Stretching (15 minutes):\nFoam roll everything: quads, hamstrings, glutes, calves, upper back, lats (10 minutes)\nStatic stretching: hip flexors, hamstrings, quads, glutes, chest, shoulders, lats (5 minutes)\nFocus on areas that feel tight from testing\n\nLight Conditioning (20 minutes):\n20-minute EASY aerobic work - choose your weapon:\n\nOption A: Assault Bike\n20 minutes at conversational pace. You should be able to talk in full sentences. This is recovery work, not a sprint. Target 10-12 calories per minute.\n\nOption B: Rowing Machine\n20 minutes at easy pace. Focus on smooth, controlled strokes. Target 1500-1800m per 10 minutes. Breathing should be relaxed.\n\nOption C: Mixed Cardio\n5 minutes assault bike, 5 minutes ski erg, 5 minutes rowing, 5 minutes bike. All at easy, conversational pace.\n\nThe goal is blood flow and active recovery, not fatigue. If you're breathing hard, you're going too fast. Slow down.\n\nCooldown (10 minutes):\nWalk for 5 minutes\nStretch for 5 minutes: focus on anything that feels tight\n\nThat's it. Light day. Let your body recover from the testing week.",
      "coachingNotes": "This is pure recovery. You just hit PRs on four major lifts in three days - your nervous system is fried, your muscles are depleted. Today is about blood flow, mobility, and active recovery. The conditioning work should feel EASY - if you're working hard, you're defeating the purpose. Prioritize the mobility and stretching work - your shoulders and upper back especially need attention. Hydrate well, eat quality food, and get good sleep tonight. Tomorrow is complete rest before we start the next training block.",
      "prescribedExercises": [
        {
          "exerciseName": "Assault Bike",
          "movementType": "cardio"
        },
        {
          "exerciseName": "Rowing Machine",
          "movementType": "cardio"
        },
        {
          "exerciseName": "Ski Erg",
          "movementType": "cardio"
        }
      ],
      "status": "pending",
      "completedAt": null,
      "linkedWorkoutId": null,
      "userFeedback": null,
      "adaptationHistory": []
    },
    {
      "templateId": "template_day28_primary",
      "dayNumber": 28,
      "templateType": "optional",
      "templatePriority": 1,
      "scheduledDate": "",
      "phaseId": "phase_4",
      "name": "Complete Rest Day",
      "description": "Mandatory rest and recovery after max testing week - no training today.",
      "estimatedDuration": 20,
      "requiredEquipment": [
        "foam roller",
        "resistance bands"
      ],
      "workoutContent": "Sunday rest day. This is non-negotiable.\n\nYou just completed a full max testing week - deadlift, bench press, back squat, and push press. Your body needs complete rest to adapt and recover.\n\nOPTIONAL Light Mobility (15-20 minutes):\nIf you feel like moving, keep it very light:\n\nFoam roll: any areas that feel tight (5-10 minutes)\nGentle stretching: hip flexors, hamstrings, shoulders, upper back (10 minutes)\nWalking: 10-15 minutes easy walk outside if weather permits\n\nThat's it. No lifting, no conditioning, no intensity.\n\nRECOVERY PRIORITIES TODAY:\n- Sleep: aim for 7-8 hours if possible (I know you're getting 5-6, but try for more today)\n- Nutrition: eat quality food, prioritize protein\n- Hydration: drink plenty of water\n- Stress management: take time to decompress from the week\n- Mental recovery: reflect on your PRs, celebrate your progress\n\nThis week you established new baselines on all four major lifts. That's significant progress. Next week we start a new training block built on these new numbers. Rest up - you've earned it.",
      "coachingNotes": "Mandatory rest day. Do not train today. Your nervous system needs recovery after max testing. If you feel restless, light mobility work is fine, but no training stimulus. Use today to prepare mentally for the next training block - we'll build on your new 1RM numbers to push toward your ultimate goals (315 deadlift, 275 squat, 315 bench, 185 push press). Take care of your body today so you can attack the work next week. This is discipline - resting when you need to rest is as important as training hard when you need to train hard.",
      "prescribedExercises": [],
      "status": "pending",
      "completedAt": null,
      "linkedWorkoutId": null,
      "userFeedback": null,
      "adaptationHistory": []
    }
  ],
  "generationMetadata": {
    "generatedAt": "2025-10-25T22:44:25.296Z",
    "generatedBy": "ai-conversation",
    "aiModel": "us.anthropic.claude-sonnet-4-5-20250929-v1:0",
    "confidence": 0.95,
    "generationPrompt": "Generated from Build mode conversation conv_1760623582146_5u6z1kags"
  }
}